Bash.org
:PROPERTIES:
:ID:       db35e2a9-9fd2-41b9-9c5f-81431fdb8860
:END:
#+title: Bash Configuration
#+description:
#+startup: content
#+property: header-args        :tangle-mode (identity #o444) :mkdirp yes
#+property: header-args:sh     :tangle-mode (identity #o555) :mkdirp yes
#+property: header-args:bash   :tangle-mode (identity #o555) :mkdirp yes
#+property: header-args:scheme :tangle-mode (identity #o644) :mkdirp yes :comments link
#+options: toc:nil

* Table Of Contents :TOC_2_gh:
  - [[#profile-hooks][Profile Hooks]]
  - [[#guix][Guix]]
  - [[#podman][Podman]]
  - [[#docker][Docker]]
- [[#hardware][Hardware]]
- [[#languages][Languages]]
  - [[#java][Java]]
  - [[#graphql][GraphQL]]
  - [[#python][Python]]
  - [[#julia][Julia]]
- [[#profile][Profile]]
  - [[#profile-1][=.profile=]]
- [[#shells][Shells]]
  - [[#rc][RC]]
- [[#environment][Environment]]
  - [[#devtools][devtools]]
  - [[#xdg][XDG]]

** Profile Hooks

**** Default Scripts

#+begin_src sh :tangle .config/sh/_load_profile.eg.sh :shebang #!/bin/sh
# This is the default _load_profile.d.sh script

__scripts=(
    "guix.sh"
    "emacs.sh"
    "java.sh"
    "julia.sh"
    "graphviz.sh"
    "flatpak.sh"
)
for __script in ${__scripts[@]}; do
    [[ -f $DOTS_PROFILE_D/$__script ]] && source $DOTS_PROFILE_D/$__script || echo "couldn't load $__script"
done
unset $__script
# unset $__scripts
#+end_src

***** RC

#+begin_src sh :tangle .config/sh/_load_rc.eg.sh :shebang #!/bin/sh
# This is the default _load_rc.d.sh script

__scripts=(
    "aliases.sh"
    "functions.sh"
    "colors.sh"
    "git-prompt.sh"
    "prompt.sh"
)
for __script in ${__scripts[@]}; do
    [[ -f $DOTS_RC_D/$__script ]] && source $DOTS_RC_D/$__script || echo "couldn't load $__script"
done
unset $__script
# unset $__scripts
#+end_src


** Guix

=GUIX_AUTOLOAD_PROFILES=(desktop i3)= should be set in the script run
by the login/display manager, but not exported.

#+begin_src sh :tangle .config/sh/profile.d/guix.sh :shebang #!/bin/sh
# TODO fix for non-guix-systems
# GUIX_PROFILE="$HOME/.guix-profile"
# . "$GUIX_PROFILE/etc/profile"

export GUIX_LOCPATH=$HOME/.guix-profile/lib/locale

# -c cores -m jobs
export GUIX_BUILD_OPTIONS="-c$NCPU"
export GUIX_EXTRA=$HOME/.guix-extra-profiles

#+end_src

#+begin_src sh :tangle .config/sh/profile.d/guix-profiles.sh
# GUIX_AUTOLOAD_PROFILES=(desktop i3)
if [[ -z $GUIX_AUTOLOAD_PROFILES ]]; then
    GUIX_AUTOLOAD_PROFILES=(i3 desktop fonts browsers xkb pipewire \
                               mon devtools academic office cad kicad \
                               pythondev k8s)
fi

for i in ${GUIX_AUTOLOAD_PROFILES[@]}; do
  echo $i
  profile=$GUIX_EXTRA/$i/$i
  if [ -f "$profile"/etc/profile ]; then
    GUIX_PROFILE="$profile"
    . "$GUIX_PROFILE"/etc/profile
  fi
  unset $profile
done
#+end_src

*** On Arch
**** Load Guix Profiles

#+begin_src sh :tangle .config/sh/profile.d/guix-arch-support.sh :shebang #!/bin/bash
export GUIX_EXTRA=$HOME/.guix-extra-profiles

guix_arch_load() {
    local profiles=""

    while [ "$1" != "" ]; do
        case $1 in
            -*|--*=) # unsupported flags
            echo "Error: Unsupported flags $1" >&2
            return 1
            ;;
            ,*)
                profiles="$profiles $1"
                shift
                ;;
        esac
    done

    if [ -z "$profiles" ]; then
        # NOTE: this glob behaves strangely when $GUIX_EXTRA is empty
        # profiles="$GUIX_EXTRA/*";
        echo "Error: no profiles specified"
    fi

    local profilePath=""
    for p in $profiles; do
        profile=$(basename $p)
        echo $profile
        profilePath=$GUIX_EXTRA/$profile
        if [ -f "$profilePath/$profile/etc/profile" ]; then
            GUIX_PROFILE="$profilePath/$profile"
            source "$GUIX_PROFILE/etc/profile"
        fi
    done

    return 0
}

export -f guix_arch_load
#+end_src

The default is -c0, which uses as many cores as possible for each build agent,
so no need to set =-c= in $GUIX_BUILD_OPTIONS

#+begin_src sh :tangle .config/sh/profile.d/guix-arch.sh :shebang #!/bin/bash
# export GUIX_BUILD_OPTIONS="-c6"

# never again, wxPython ... never again
GUIX_AUTOLOAD_PROFILES=(academic arch-devtools nyxt k8s)
if [ -z "$GUIX_ARCH_LOADED" ]; then
    guix_arch_load ${GUIX_AUTOLOAD_PROFILES[@]}
    export GUIX_ARCH_LOADED=${GUIX_AUTOLOAD_PROFILES[@]}
fi

GUIX_PROFILE="$HOME/.config/guix/current"
source "$GUIX_PROFILE/etc/profile"
#+end_src

Add to =~/.config/sh/_load_profile.d.sh= _in this order_

+ guile-arch.sh
+ guix-arch-support.sh
+ guix-arch.sh

** Podman

Ensure that Podman stores images on the correct mount.

#+begin_example conf :tangle .config/containers/storage.conf
[storage]

driver = "overlay"
rootless_storage_path = "/storage/location"
#+end_example

Rootful images must be stored in a root-owned folder directory with correct
permissions AFAIK.

** Docker

Ensure that Docker is configured to store images on the correct mount.

#+begin_example json :tangle /etc/docker/daemon.json
{
  "data-root": "/storage/location"
}
#+end_example

The docker systemd services must have been run at least once for many of its
paths to exist.

Test with =docker pull docker.io/netbootxyz/netbootxyz=

* Hardware

#+begin_src sh :tangle .profile :shebang #!/bin/sh
export PATH=$HOME/.local/bin:$HOME/bin:$PATH
export DISTRO="$(grep -e '^ID=' /etc/os-release | sed -e 's/^ID=//g')"

# can't add functions to .bash_profile: only .bashrc
export NTHREADS="$(ncpu-threads)"
if [[ -n "$NTHREADS" ]]; then
    NCPU="$((NTHREADS / 2))"
else
    NCPU="4"
fi
export NCPU
#+end_src

* Languages

** Java

#+begin_src sh :tangle .config/sh/profile.d/java.sh :shebang #!/bin/sh
export _JAVA_AWT_WM_NONREPARENTING=1

# This sets Java Swing UI -> GTK
#export _JAVA_OPTIONS="-Dawt.useSystemAAFontSettings=on -Dswing.aatext=true -Dswing.defaultlaf=com.sun.java.swing.plaf.gtk.GTKLookAndFeel -Dswing.crossplatformlaf=com.sun.java.swing.plaf.gtk.GTKLookAndFeel $_JAVA_OPTIONS"

# multiple java versions
# https://docs.doomemacs.org/v21.12/modules/lang/java/#/prerequisites/multiple-java-versions

# TODO: set differently for arch/guix
#export JAVA_HOME=/usr/local/jdk-11.0.2
#export PATH=$PATH:$JAVA_HOME/bin

export ECLIPSE_HOME=${_LANG}/.eclipse/eclipse
#+end_src

*** Eclipse

For Guix, eclipse should basically just require an OpenJDK

#+begin_src sh :tangle bin/eclipse.sh :shebang #!/bin/sh
export ECLIPSE_HOME=${_LANG}/.eclipse/eclipse

# TODO: provide JAVA_PATH/etc and exec eclipse 
#+end_src


** GraphQL

On Guix, ensure =nodejs= profile is installed.

#+begin_src :eval no
npm install -g graphql-language-service-cli
#+end_src

Graphql-language-service-cli depends on:

+ graphql-language-service
+ graphql-language-service-server

Other tools include:

+ graphiql
+ codemirror-graphql
+ graphiql

*** GraphQL Project Setup

On Guix Systems, add the =nodejs= profile to the project or ensure that it's in
=$PATH=. Most actual projects will have their own =manifest.scm= anyways. This
will be a separate node build, but its =npm install -g= binaries will still go
in =.node_modules=

#+begin_src sh
#or use_guix_manifest -m $XDG_CONFIG_HOME/guix/manifests/nodejs.scm
use_guix_profile -m $GUIX_EXTRA/nodejs/nodejs
#+end_src

***** TODO finalize on =use_guixs=
***** TODO how to designate the default graphql schema file for the above?

** Python

This should end up in =$HOME= to fix an issue where =jupyter.el= uses =$HOME=
as its default directory. This main python should have =pip= set up with the
=jupyter-lab= environment, which can load kernels can be built from other
=venvs= ... (this might conflict with other information on jupyter herein)

#+begin_src sh :tangle .python-version
3.12.1
#+end_src

*** Python on Arch

**** Pyenv

Ensure pyenv is installed with =yay -Syu pyenv= and add this to
=.config/sh/_load_profile.d.sh=. This should be loaded after all the guix
profiles, in case one contains a python.

#+begin_src sh :tangle .config/sh/profile.d/python-pyenv.sh :shebang #!/bin/sh
export PYENV_POETRY_VENV=poetry
export PYENV_ROOT="$_LANG/.pyenv"
command -v pyenv >/dev/null || export PATH="$PYENV_ROOT/bin:$PATH"
eval "$(pyenv init -)"
source "${PYENV_ROOT}/completions/pyenv.bash"
#+end_src

+ Install new pythons with =pyenv install 3.11.3= and see below for optimizations.
+ List versions with =pyenv install -l=
+ Switch with =pyenv (shell|local|global) $python_version=. This is currently
  not working, since I only have =eval $(pyenv init -)= sourced in =.profile=,
  which forgets the =pyenv()= function. To get the shell integration to work, it
  needs to be added to =.bashrc=.

See direnv integration below.

****** TODO evaluate whether I should add =pyenv= to both =.profile= and =.bashrc=

***** Switching

Caveat scriptor: running =pyenv local $pyversion= will create a
=$PWD/.python-version= file. Use =pyenv shell $pyversion= instead.

***** Custom Pyenv builds

See pyenv's =python-build= plugin to customize the build

+ [[https://github.com/pyenv/pyenv/tree/master/plugins/python-build#special-environment-variables][Environment vars]] for pyenv's python-build plugin.
+ The spec for [[https://github.com/pyenv/pyenv/blob/master/plugins/python-build/share/python-build/3.11.3][Python 3.11.3]] is in =./plugins/python-build/share/3.11.3/=
+ The installations will source functions in
  =./plugins/python-build/bin/python-build=, including =install_package= which
  fetches source for python.
+ It also fetches packages like =readline= or =openssl-1.1.1s= if your Mac's is
  broken. I guess OpenSSL3 is [[https://peps.python.org/pep-0644/][taking its sweet time]], but convenience comes at a
  cost -- mostly, you'll run into issues with the [[https://cryptography.io/en/latest/installation/#building-cryptography-on-macos][cryptography package]].

****** Optimizations

To build with optimizations:

#+begin_src sh
PYTHON_CONFIGURE_OPTS='--enable-optimizations --with-lto' PYTHON_CFLAGS='-march=native -mtune=native'
#+end_src

To build in parallel (doesn't seem to help)

#+begin_src sh
MAKE_OPTS="-j14" PYTHON_MAKE_OPTS="-j14"
#+end_src

Full command

#+begin_src sh :tangle bin/pynv-install-py
[[ -z "$1" ]] && echo "Requires semantic version" && exit 1;

version=$1

mjobs=$((NTHREADS - 2))

env PYTHON_CONFIGURE_OPTS='--enable-optimizations --with-lto' \
    PYTHON_CFLAGS='-march=native -mtune=native' \
    PYTHON_MAKE_OPTS="-j$mjobs" \
    MAKE_OPTS="-j$mjobs" \
    pyenv install $version 2>&1 > ~/src/log/python-build-$version.log
#+end_src

Then =pip install --upgrade pip= and set up =jupyter-lab= from within that new
python's main env.

#+begin_example sh
pip install --upgrade
pip install jupyter-lab # etc...
#+end_example

**** Poetry

Basically poetry projects (& their venv's) will need to be handled
separately. From what I understand, each python that is installed will need to
have its own =poetry= installed. The =virtualenvs.prefer-active-python= will
accomplish that, as long as poetry runs after =direnv= sets the =pyenv= and as
long as there isn't an active =venv= for that =pyenv= in the shell -- these have
a separate =pip=.

There is also [[https://github.com/tjquillan/poetry-plugin-pyenv][tjquillan/poetry-plugin-pyenv]].

***** Keyring

In KDE, unless there's a reason for pip to cache in keyring, then maybe
disable it: =`pyenv which python3` -m keyring --disable=

See [[https://stackoverflow.com/a/68760190]]

***** Poetry Config

See [[id:][configuration]] docs. The shared poetry configuration, which will use the
=poetry= shim in the python selected by =pyenv= selects. In any python project,
the version should be set by =.python-version=.

#+begin_src conf-toml :tangle .config/pypoetry/config.toml
[virtualenvs]
prefer-active-python = true
#+end_src

****** Defaults

Without any other config, once =poetry= is installed for =$pyversion=, then
=poetry config --list= should show:

#+begin_src conf
cache-dir = "$HOME/.cache/pypoetry"
experimental.new-installer = true
experimental.system-git-client = false
installer.max-workers = null
installer.modern-installation = true
installer.no-binary = null
installer.parallel = true
virtualenvs.create = true
virtualenvs.in-project = null
virtualenvs.options.always-copy = false
virtualenvs.options.no-pip = false
virtualenvs.options.no-setuptools = false
virtualenvs.options.system-site-packages = false
virtualenvs.path = "{cache-dir}/virtualenvs"  # $HOME/.cache/pypoetry/virtualenvs
virtualenvs.prefer-active-python = false
virtualenvs.prompt = "{project_name}-py{python_version}"
#+end_src

**** Python Direnv

This method is compatible with the others, so a project on one laptop with
=pyenv= and lacking the =pyenv-virtualenv= plugin will simply need to change
=.envrc=. Both should be able to use =layout python=.

*Generally*

+ Use =layout poetry= where practical/possible (... test?)
+ Use the =pyenv-virtualenv= for one-off environments or things to don't fit
  neatly into dependency specs

***** Direnv: [[https://github.com/direnv/direnv/wiki/Python#venv-stdlib-module][layout python3]]

Specify with =layout python3=, which uses venv stdlib module

This directive causes a virtualenv to be created at
=$PWD/.direnv/python-$python_version=.

#+begin_quote
Commenting out the =layout= will cause this directory to appear.
#+end_quote

***** Direnv: [[https://github.com/direnv/direnv/wiki/Python#poetry][layout pyenv]]

Requires [[github:pyenv/pyenv][pyenv/pyenv]]

Specify with =layout pyenv $python_version=

This directive still installs python packages in the virtualenv at
=$PWD/.direnv/python-$python_version=.

#+begin_quote
Commenting out the =${pyenv}= will cause this directory to appear.
#+end_quote

